Revit 2026 API

# DrawContextIsTransparentPass Method

---

Determines whether the current rendering pass is for transparent objects.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsTransparentPass()
```
```vb
Public Shared Function IsTransparentPass As Boolean
```
```cpp
public:
static bool IsTransparentPass()
```
```fsharp
static member IsTransparentPass : unit -> bool
```

#### Return Value

Boolean True when the server should be submitting transparent objects for rendering, false otherwise.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer. |

Opaque and transparent geometry should be submitted for rendering separately. See UseInTransparentPass(View).

#### Reference

DrawContext Class

Autodesk.Revit.DB.DirectContext3D Namespace